#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mazurerm_static_site.crc-sox: Refreshing state... [id=/subscriptions/e35f2b7a-c9ca-4ee0-9db3-d85061d32776/resourceGroups/CRCSOX-Dev/providers/Microsoft.Web/staticSites/CRCSOX-Client-Prod][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # azurerm_static_site.crc-sox[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_static_site" "crc-sox" {
      [33m~[0m [0m[1m[0mapi_key[0m[0m             = "628fd65cd3ec7f510ffa1930ecc736820810666a9a8818dcae1a9b29469991272-55382892-a102-4e0f-94e1-bc408f44e7b4010142420" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mdefault_host_name[0m[0m   = "witty-field-067ab8010.2.azurestaticapps.net" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m                  = "/subscriptions/e35f2b7a-c9ca-4ee0-9db3-d85061d32776/resourceGroups/CRCSOX-Dev/providers/Microsoft.Web/staticSites/CRCSOX-Client-Prod" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mname[0m[0m                = "CRCSOX-Client-Prod" [33m->[0m [0m"CRCSOX-Client-Dev" [31m# forces replacement[0m[0m
      [31m-[0m [0m[1m[0mtags[0m[0m                = {} [90m->[0m [0m[90mnull[0m[0m
        [90m# (4 unchanged attributes hidden)[0m[0m
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 1 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @charliedalldorf, Action: `pull_request`*